{"id": "Q1", "text": "Is there evidence that identity authentication and privilege activity was observed in control-plane actions during the investigation timeframe?", "label": "Identity: Evidence observed - Control-plane actions", "category": "Identity", "archetype": "detect"}
{"id": "Q2", "text": "Is there evidence that endpoint execution and persistence activity was observed in transport metadata during the investigation timeframe?", "label": "Host: Evidence observed - Transport metadata", "category": "Host", "archetype": "detect"}
{"id": "Q3", "text": "Is there evidence that network session and transport activity was observed in privileged access events during the investigation timeframe?", "label": "Network: Evidence observed - Privileged access events", "category": "Network", "archetype": "detect"}
{"id": "Q4", "text": "Is there evidence that cloud control-plane and workload activity was observed in session anomalies during the investigation timeframe?", "label": "Cloud: Evidence observed - Session anomalies", "category": "Cloud", "archetype": "detect"}
{"id": "Q5", "text": "Is there evidence that mailbox message and collaboration activity was observed in collaboration artifacts during the investigation timeframe?", "label": "Email: Evidence observed - Collaboration artifacts", "category": "Email", "archetype": "detect"}
{"id": "Q6", "text": "Is there evidence that application request and session activity was observed in execution lineage during the investigation timeframe?", "label": "Application: Evidence observed - Execution lineage", "category": "Application", "archetype": "detect"}
{"id": "Q7", "text": "Is there evidence that file artifact and content activity was observed in process ancestry during the investigation timeframe?", "label": "File: Evidence observed - Process ancestry", "category": "File", "archetype": "detect"}
{"id": "Q8", "text": "Is identity authentication and privilege activity present in collected evidence related to content lineage?", "label": "Identity: Evidence present - Content lineage", "category": "Identity", "archetype": "detect"}
{"id": "Q9", "text": "Is endpoint execution and persistence activity present in collected evidence related to control-plane actions?", "label": "Host: Evidence present - Control-plane actions", "category": "Host", "archetype": "detect"}
{"id": "Q10", "text": "Is network session and transport activity present in collected evidence related to transport metadata?", "label": "Network: Evidence present - Transport metadata", "category": "Network", "archetype": "detect"}
{"id": "Q11", "text": "Is cloud control-plane and workload activity present in collected evidence related to privileged access events?", "label": "Cloud: Evidence present - Privileged access events", "category": "Cloud", "archetype": "detect"}
{"id": "Q12", "text": "Is mailbox message and collaboration activity present in collected evidence related to session anomalies?", "label": "Email: Evidence present - Session anomalies", "category": "Email", "archetype": "detect"}
{"id": "Q13", "text": "Is application request and session activity present in collected evidence related to collaboration artifacts?", "label": "Application: Evidence present - Collaboration artifacts", "category": "Application", "archetype": "detect"}
{"id": "Q14", "text": "Is file artifact and content activity present in collected evidence related to execution lineage?", "label": "File: Evidence present - Execution lineage", "category": "File", "archetype": "detect"}
{"id": "Q82", "text": "Have investigators confirmed that network session and transport activity in artifact provenance is authentic telemetry?", "label": "Network: Telemetry authentic - Artifact provenance", "category": "Network", "archetype": "validate"}
{"id": "Q83", "text": "Have investigators confirmed that cloud control-plane and workload activity in message delivery paths is authentic telemetry?", "label": "Cloud: Telemetry authentic - Message delivery paths", "category": "Cloud", "archetype": "validate"}
{"id": "Q85", "text": "Have investigators confirmed that application request and session activity in authentication pathways is authentic telemetry?", "label": "Application: Telemetry authentic - Authentication pathways", "category": "Application", "archetype": "validate"}
{"id": "Q86", "text": "Have investigators confirmed that file artifact and content activity in data access traces is authentic telemetry?", "label": "File: Telemetry authentic - Data access traces", "category": "File", "archetype": "validate"}
{"id": "Q147", "text": "Have corroborating records validated mailbox message and collaboration activity linked to message delivery paths?", "label": "Email: Corroborated - Message delivery paths", "category": "Email", "archetype": "validate"}
{"id": "Q148", "text": "Have corroborating records validated application request and session activity linked to workload identity context?", "label": "Application: Corroborated - Workload identity context", "category": "Application", "archetype": "validate"}
{"id": "Q149", "text": "Have corroborating records validated file artifact and content activity linked to authentication pathways?", "label": "File: Corroborated - Authentication pathways", "category": "File", "archetype": "validate"}
{"id": "Q150", "text": "Was observed identity authentication and privilege activity for control-plane actions validated using independent evidence sources?", "label": "Identity: Independent validation - Control-plane actions", "category": "Identity", "archetype": "validate"}
{"id": "Q151", "text": "Have investigators confirmed that endpoint execution and persistence activity in api invocation patterns is authentic telemetry?", "label": "Host: Telemetry authentic - API invocation patterns", "category": "Host", "archetype": "validate"}
{"id": "Q152", "text": "Have investigators confirmed that network session and transport activity in network pivots is authentic telemetry?", "label": "Network: Telemetry authentic - Network pivots", "category": "Network", "archetype": "validate"}
{"id": "Q153", "text": "Have investigators confirmed that cloud control-plane and workload activity in endpoint state changes is authentic telemetry?", "label": "Cloud: Telemetry authentic - Endpoint state changes", "category": "Cloud", "archetype": "validate"}
{"id": "Q154", "text": "Have investigators confirmed that mailbox message and collaboration activity in artifact provenance is authentic telemetry?", "label": "Email: Telemetry authentic - Artifact provenance", "category": "Email", "archetype": "validate"}
{"id": "Q155", "text": "Was observed identity authentication and privilege activity for collaboration artifacts validated using independent evidence sources?", "label": "Identity: Independent validation - Collaboration artifacts", "category": "Identity", "archetype": "validate"}
{"id": "Q156", "text": "Have investigators confirmed that endpoint execution and persistence activity in message delivery paths is authentic telemetry?", "label": "Host: Telemetry authentic - Message delivery paths", "category": "Host", "archetype": "validate"}
{"id": "Q159", "text": "Does validated network session and transport activity for collaboration artifacts align with benign activity, policy violation, or malicious behavior?", "label": "Network: Behavior alignment - Collaboration artifacts", "category": "Network", "archetype": "classify"}
{"id": "Q161", "text": "Does validated mailbox message and collaboration activity for process ancestry align with benign activity, policy violation, or malicious behavior?", "label": "Email: Behavior alignment - Process ancestry", "category": "Email", "archetype": "classify"}
{"id": "Q184", "text": "Is the classification of file artifact and content activity in execution lineage supported with sufficient confidence?", "label": "File: Confidence check - Execution lineage", "category": "File", "archetype": "classify"}
{"id": "Q187", "text": "Does validated network session and transport activity for control-plane actions align with benign activity, policy violation, or malicious behavior?", "label": "Network: Behavior alignment - Control-plane actions", "category": "Network", "archetype": "classify"}
{"id": "Q188", "text": "Does validated cloud control-plane and workload activity for transport metadata align with benign activity, policy violation, or malicious behavior?", "label": "Cloud: Behavior alignment - Transport metadata", "category": "Cloud", "archetype": "classify"}
{"id": "Q190", "text": "Does validated application request and session activity for session anomalies align with benign activity, policy violation, or malicious behavior?", "label": "Application: Behavior alignment - Session anomalies", "category": "Application", "archetype": "classify"}
{"id": "Q214", "text": "Did endpoint execution and persistence activity in network pivots support at least one bounded technical hypothesis with testable evidence?", "label": "Host: Hypothesis framing - Network pivots", "category": "Host", "archetype": "classify"}
{"id": "Q219", "text": "Does validated file artifact and content activity for control-plane actions align with benign activity, policy violation, or malicious behavior?", "label": "File: Behavior alignment - Control-plane actions", "category": "File", "archetype": "classify"}
{"id": "Q221", "text": "Does endpoint execution and persistence activity observed in api invocation patterns indicate adversarial intent?", "label": "Host: Adversarial intent - API invocation patterns", "category": "Host", "archetype": "classify"}
{"id": "Q223", "text": "Is the classification of cloud control-plane and workload activity in collaboration artifacts supported with sufficient confidence?", "label": "Cloud: Confidence check - Collaboration artifacts", "category": "Cloud", "archetype": "classify"}
{"id": "Q224", "text": "Is the classification of mailbox message and collaboration activity in execution lineage supported with sufficient confidence?", "label": "Email: Confidence check - Execution lineage", "category": "Email", "archetype": "classify"}
{"id": "Q225", "text": "Is the classification of application request and session activity in process ancestry supported with sufficient confidence?", "label": "Application: Confidence check - Process ancestry", "category": "Application", "archetype": "classify"}
{"id": "Q233", "text": "Did identity authentication and privilege activity in api invocation patterns support at least one bounded technical hypothesis with testable evidence?", "label": "Identity: Hypothesis framing - API invocation patterns", "category": "Identity", "archetype": "classify"}
{"id": "Q240", "text": "Have scope boundaries for endpoint execution and persistence activity in process ancestry been expanded to include connected evidence?", "label": "Host: Scope boundaries - Process ancestry", "category": "Host", "archetype": "scope"}
{"id": "Q244", "text": "Were upstream and downstream dependencies for application request and session activity in network pivots included in scope?", "label": "Application: Dependencies in scope - Network pivots", "category": "Application", "archetype": "scope"}
{"id": "Q245", "text": "Were upstream and downstream dependencies for file artifact and content activity in endpoint state changes included in scope?", "label": "File: Dependencies in scope - Endpoint state changes", "category": "File", "archetype": "scope"}
{"id": "Q246", "text": "Were additional assets, identities, sessions, or artifacts tied to identity authentication and privilege activity in collaboration artifacts brought into scope?", "label": "Identity: Additional assets in scope - Collaboration artifacts", "category": "Identity", "archetype": "scope"}
{"id": "Q248", "text": "Were additional assets, identities, sessions, or artifacts tied to network session and transport activity in process ancestry brought into scope?", "label": "Network: Additional assets in scope - Process ancestry", "category": "Network", "archetype": "scope"}
{"id": "Q253", "text": "Have scope boundaries for identity authentication and privilege activity in session anomalies been expanded to include connected evidence?", "label": "Identity: Scope boundaries - Session anomalies", "category": "Identity", "archetype": "scope"}
{"id": "Q256", "text": "Were upstream and downstream dependencies for cloud control-plane and workload activity in workload identity context included in scope?", "label": "Cloud: Dependencies in scope - Workload identity context", "category": "Cloud", "archetype": "scope"}
{"id": "Q257", "text": "Were upstream and downstream dependencies for mailbox message and collaboration activity in authentication pathways included in scope?", "label": "Email: Dependencies in scope - Authentication pathways", "category": "Email", "archetype": "scope"}
{"id": "Q258", "text": "Were upstream and downstream dependencies for application request and session activity in data access traces included in scope?", "label": "Application: Dependencies in scope - Data access traces", "category": "Application", "archetype": "scope"}
{"id": "Q259", "text": "Were upstream and downstream dependencies for file artifact and content activity in api invocation patterns included in scope?", "label": "File: Dependencies in scope - API invocation patterns", "category": "File", "archetype": "scope"}
{"id": "Q261", "text": "Were additional assets, identities, sessions, or artifacts tied to endpoint execution and persistence activity in session anomalies brought into scope?", "label": "Host: Additional assets in scope - Session anomalies", "category": "Host", "archetype": "scope"}
{"id": "Q268", "text": "Have scope boundaries for endpoint execution and persistence activity in privileged access events been expanded to include connected evidence?", "label": "Host: Scope boundaries - Privileged access events", "category": "Host", "archetype": "scope"}
{"id": "Q269", "text": "Have scope boundaries for network session and transport activity in session anomalies been expanded to include connected evidence?", "label": "Network: Scope boundaries - Session anomalies", "category": "Network", "archetype": "scope"}
{"id": "Q277", "text": "Were materially affected entities linked to cloud control-plane and workload activity in endpoint state changes identified for investigative scope?", "label": "Cloud: Affected entities - Endpoint state changes", "category": "Cloud", "archetype": "scope"}
{"id": "Q279", "text": "Were materially affected entities linked to application request and session activity in message delivery paths identified for investigative scope?", "label": "Application: Affected entities - Message delivery paths", "category": "Application", "archetype": "scope"}
{"id": "Q280", "text": "Were materially affected entities linked to file artifact and content activity in workload identity context identified for investigative scope?", "label": "File: Affected entities - Workload identity context", "category": "File", "archetype": "scope"}
{"id": "Q281", "text": "Have scope boundaries for identity authentication and privilege activity in content lineage been expanded to include connected evidence?", "label": "Identity: Scope boundaries - Content lineage", "category": "Identity", "archetype": "scope"}
{"id": "Q282", "text": "Have scope boundaries for endpoint execution and persistence activity in control-plane actions been expanded to include connected evidence?", "label": "Host: Scope boundaries - Control-plane actions", "category": "Host", "archetype": "scope"}
{"id": "Q283", "text": "Have scope boundaries for network session and transport activity in transport metadata been expanded to include connected evidence?", "label": "Network: Scope boundaries - Transport metadata", "category": "Network", "archetype": "scope"}
{"id": "Q284", "text": "Were upstream and downstream dependencies for cloud control-plane and workload activity in network pivots included in scope?", "label": "Cloud: Dependencies in scope - Network pivots", "category": "Cloud", "archetype": "scope"}
{"id": "Q285", "text": "Were upstream and downstream dependencies for mailbox message and collaboration activity in endpoint state changes included in scope?", "label": "Email: Dependencies in scope - Endpoint state changes", "category": "Email", "archetype": "scope"}
{"id": "Q286", "text": "Were upstream and downstream dependencies for application request and session activity in artifact provenance included in scope?", "label": "Application: Dependencies in scope - Artifact provenance", "category": "Application", "archetype": "scope"}
{"id": "Q288", "text": "Were additional assets, identities, sessions, or artifacts tied to identity authentication and privilege activity in process ancestry brought into scope?", "label": "Identity: Additional assets in scope - Process ancestry", "category": "Identity", "archetype": "scope"}
{"id": "Q289", "text": "Were additional assets, identities, sessions, or artifacts tied to endpoint execution and persistence activity in content lineage brought into scope?", "label": "Host: Additional assets in scope - Content lineage", "category": "Host", "archetype": "scope"}
{"id": "Q290", "text": "Were additional assets, identities, sessions, or artifacts tied to network session and transport activity in control-plane actions brought into scope?", "label": "Network: Additional assets in scope - Control-plane actions", "category": "Network", "archetype": "scope"}
{"id": "Q291", "text": "Were materially affected entities linked to cloud control-plane and workload activity in api invocation patterns identified for investigative scope?", "label": "Cloud: Affected entities - API invocation patterns", "category": "Cloud", "archetype": "scope"}
{"id": "Q292", "text": "Were materially affected entities linked to mailbox message and collaboration activity in network pivots identified for investigative scope?", "label": "Email: Affected entities - Network pivots", "category": "Email", "archetype": "scope"}
{"id": "Q293", "text": "Were materially affected entities linked to application request and session activity in endpoint state changes identified for investigative scope?", "label": "Application: Affected entities - Endpoint state changes", "category": "Application", "archetype": "scope"}
{"id": "Q295", "text": "Have scope boundaries for identity authentication and privilege activity in execution lineage been expanded to include connected evidence?", "label": "Identity: Scope boundaries - Execution lineage", "category": "Identity", "archetype": "scope"}
{"id": "Q299", "text": "Were upstream and downstream dependencies for mailbox message and collaboration activity in api invocation patterns included in scope?", "label": "Email: Dependencies in scope - API invocation patterns", "category": "Email", "archetype": "scope"}
{"id": "Q302", "text": "Were materially affected entities linked to endpoint execution and persistence activity in authentication pathways identified for investigative scope?", "label": "Host: Affected entities - Authentication pathways", "category": "Host", "archetype": "scope"}
{"id": "Q303", "text": "Were materially affected entities linked to network session and transport activity in data access traces identified for investigative scope?", "label": "Network: Affected entities - Data access traces", "category": "Network", "archetype": "scope"}
{"id": "Q306", "text": "Were upstream and downstream dependencies for network session and transport activity in api invocation patterns included in scope?", "label": "Network: Dependencies in scope - API invocation patterns", "category": "Network", "archetype": "scope"}
{"id": "Q313", "text": "Did timeline correlation for endpoint execution and persistence activity in authentication pathways reveal synchronized cross-domain activity?", "label": "Host: Timeline correlation - Authentication pathways", "category": "Host", "archetype": "correlate"}
{"id": "Q315", "text": "Did timeline correlation for cloud control-plane and workload activity in api invocation patterns reveal synchronized cross-domain activity?", "label": "Cloud: Timeline correlation - API invocation patterns", "category": "Cloud", "archetype": "correlate"}
{"id": "Q317", "text": "Have pivoted indicators for application request and session activity in collaboration artifacts strengthened correlation confidence?", "label": "Application: Pivot strengthening - Collaboration artifacts", "category": "Application", "archetype": "correlate"}
{"id": "Q318", "text": "Have pivoted indicators for file artifact and content activity in execution lineage strengthened correlation confidence?", "label": "File: Pivot strengthening - Execution lineage", "category": "File", "archetype": "correlate"}
{"id": "Q320", "text": "Did multi-source correlation for endpoint execution and persistence activity in workload identity context expose linked investigative signals?", "label": "Host: Multi-source correlation - Workload identity context", "category": "Host", "archetype": "correlate"}
{"id": "Q322", "text": "Did multi-source correlation for cloud control-plane and workload activity in data access traces expose linked investigative signals?", "label": "Cloud: Multi-source correlation - Data access traces", "category": "Cloud", "archetype": "correlate"}
{"id": "Q323", "text": "Did mailbox message and collaboration activity in privileged access events correlate with evidence from at least one other domain?", "label": "Email: Cross-domain correlation - Privileged access events", "category": "Email", "archetype": "correlate"}
{"id": "Q328", "text": "Did timeline correlation for network session and transport activity in workload identity context reveal synchronized cross-domain activity?", "label": "Network: Timeline correlation - Workload identity context", "category": "Network", "archetype": "correlate"}
{"id": "Q331", "text": "Have pivoted indicators for application request and session activity in privileged access events strengthened correlation confidence?", "label": "Application: Pivot strengthening - Privileged access events", "category": "Application", "archetype": "correlate"}
{"id": "Q333", "text": "Did multi-source correlation for identity authentication and privilege activity in endpoint state changes expose linked investigative signals?", "label": "Identity: Multi-source correlation - Endpoint state changes", "category": "Identity", "archetype": "correlate"}
{"id": "Q334", "text": "Did multi-source correlation for endpoint execution and persistence activity in artifact provenance expose linked investigative signals?", "label": "Host: Multi-source correlation - Artifact provenance", "category": "Host", "archetype": "correlate"}
{"id": "Q337", "text": "Did mailbox message and collaboration activity in control-plane actions correlate with evidence from at least one other domain?", "label": "Email: Cross-domain correlation - Control-plane actions", "category": "Email", "archetype": "correlate"}
{"id": "Q338", "text": "Did application request and session activity in transport metadata correlate with evidence from at least one other domain?", "label": "Application: Cross-domain correlation - Transport metadata", "category": "Application", "archetype": "correlate"}
{"id": "Q339", "text": "Did file artifact and content activity in privileged access events correlate with evidence from at least one other domain?", "label": "File: Cross-domain correlation - Privileged access events", "category": "File", "archetype": "correlate"}
{"id": "Q340", "text": "Did timeline correlation for identity authentication and privilege activity in network pivots reveal synchronized cross-domain activity?", "label": "Identity: Timeline correlation - Network pivots", "category": "Identity", "archetype": "correlate"}
{"id": "Q344", "text": "Have pivoted indicators for mailbox message and collaboration activity in content lineage strengthened correlation confidence?", "label": "Email: Pivot strengthening - Content lineage", "category": "Email", "archetype": "correlate"}
{"id": "Q345", "text": "Have pivoted indicators for application request and session activity in control-plane actions strengthened correlation confidence?", "label": "Application: Pivot strengthening - Control-plane actions", "category": "Application", "archetype": "correlate"}
{"id": "Q346", "text": "Have pivoted indicators for file artifact and content activity in transport metadata strengthened correlation confidence?", "label": "File: Pivot strengthening - Transport metadata", "category": "File", "archetype": "correlate"}
{"id": "Q347", "text": "Did multi-source correlation for identity authentication and privilege activity in api invocation patterns expose linked investigative signals?", "label": "Identity: Multi-source correlation - API invocation patterns", "category": "Identity", "archetype": "correlate"}
{"id": "Q348", "text": "Did multi-source correlation for endpoint execution and persistence activity in network pivots expose linked investigative signals?", "label": "Host: Multi-source correlation - Network pivots", "category": "Host", "archetype": "correlate"}
{"id": "Q352", "text": "Did application request and session activity in content lineage correlate with evidence from at least one other domain?", "label": "Application: Cross-domain correlation - Content lineage", "category": "Application", "archetype": "correlate"}
{"id": "Q353", "text": "Did file artifact and content activity in control-plane actions correlate with evidence from at least one other domain?", "label": "File: Cross-domain correlation - Control-plane actions", "category": "File", "archetype": "correlate"}
{"id": "Q354", "text": "Did timeline correlation for identity authentication and privilege activity in data access traces reveal synchronized cross-domain activity?", "label": "Identity: Timeline correlation - Data access traces", "category": "Identity", "archetype": "correlate"}
{"id": "Q355", "text": "Did timeline correlation for endpoint execution and persistence activity in api invocation patterns reveal synchronized cross-domain activity?", "label": "Host: Timeline correlation - API invocation patterns", "category": "Host", "archetype": "correlate"}
{"id": "Q356", "text": "Did timeline correlation for network session and transport activity in network pivots reveal synchronized cross-domain activity?", "label": "Network: Timeline correlation - Network pivots", "category": "Network", "archetype": "correlate"}
{"id": "Q357", "text": "Did timeline correlation for cloud control-plane and workload activity in endpoint state changes reveal synchronized cross-domain activity?", "label": "Cloud: Timeline correlation - Endpoint state changes", "category": "Cloud", "archetype": "correlate"}
{"id": "Q358", "text": "Have pivoted indicators for mailbox message and collaboration activity in execution lineage strengthened correlation confidence?", "label": "Email: Pivot strengthening - Execution lineage", "category": "Email", "archetype": "correlate"}
{"id": "Q359", "text": "Have pivoted indicators for application request and session activity in process ancestry strengthened correlation confidence?", "label": "Application: Pivot strengthening - Process ancestry", "category": "Application", "archetype": "correlate"}
{"id": "Q360", "text": "Have pivoted indicators for file artifact and content activity in content lineage strengthened correlation confidence?", "label": "File: Pivot strengthening - Content lineage", "category": "File", "archetype": "correlate"}
{"id": "Q362", "text": "Did multi-source correlation for endpoint execution and persistence activity in data access traces expose linked investigative signals?", "label": "Host: Multi-source correlation - Data access traces", "category": "Host", "archetype": "correlate"}
{"id": "Q363", "text": "Did multi-source correlation for network session and transport activity in api invocation patterns expose linked investigative signals?", "label": "Network: Multi-source correlation - API invocation patterns", "category": "Network", "archetype": "correlate"}
{"id": "Q364", "text": "Did multi-source correlation for cloud control-plane and workload activity in network pivots expose linked investigative signals?", "label": "Cloud: Multi-source correlation - Network pivots", "category": "Cloud", "archetype": "correlate"}
{"id": "Q365", "text": "Did mailbox message and collaboration activity in collaboration artifacts correlate with evidence from at least one other domain?", "label": "Email: Cross-domain correlation - Collaboration artifacts", "category": "Email", "archetype": "correlate"}
{"id": "Q366", "text": "Did application request and session activity in execution lineage correlate with evidence from at least one other domain?", "label": "Application: Cross-domain correlation - Execution lineage", "category": "Application", "archetype": "correlate"}
{"id": "Q370", "text": "Did timeline correlation for network session and transport activity in data access traces reveal synchronized cross-domain activity?", "label": "Network: Timeline correlation - Data access traces", "category": "Network", "archetype": "correlate"}
{"id": "Q372", "text": "Have pivoted indicators for mailbox message and collaboration activity in session anomalies strengthened correlation confidence?", "label": "Email: Pivot strengthening - Session anomalies", "category": "Email", "archetype": "correlate"}
{"id": "Q375", "text": "Did timeline correlation for network session and transport activity in artifact provenance reveal synchronized cross-domain activity?", "label": "Network: Timeline correlation - Artifact provenance", "category": "Network", "archetype": "correlate"}
{"id": "Q376", "text": "Did timeline correlation for cloud control-plane and workload activity in message delivery paths reveal synchronized cross-domain activity?", "label": "Cloud: Timeline correlation - Message delivery paths", "category": "Cloud", "archetype": "correlate"}
{"id": "Q377", "text": "Have pivoted indicators for identity authentication and privilege activity in transport metadata strengthened correlation confidence?", "label": "Identity: Pivot strengthening - Transport metadata", "category": "Identity", "archetype": "correlate"}
{"id": "Q378", "text": "Have pivoted indicators for endpoint execution and persistence activity in privileged access events strengthened correlation confidence?", "label": "Host: Pivot strengthening - Privileged access events", "category": "Host", "archetype": "correlate"}
{"id": "Q379", "text": "Did timeline correlation for identity authentication and privilege activity in artifact provenance reveal synchronized cross-domain activity?", "label": "Identity: Timeline correlation - Artifact provenance", "category": "Identity", "archetype": "correlate"}
{"id": "Q380", "text": "Did timeline correlation for endpoint execution and persistence activity in message delivery paths reveal synchronized cross-domain activity?", "label": "Host: Timeline correlation - Message delivery paths", "category": "Host", "archetype": "correlate"}
{"id": "Q381", "text": "Was application request and session activity in endpoint state changes attributable to a coherent activity cluster with common intent?", "label": "Application: Activity clustering - Endpoint state changes", "category": "Application", "archetype": "attribute"}
{"id": "Q383", "text": "Does attribution evidence for identity authentication and privilege activity in execution lineage support a defensible objective hypothesis?", "label": "Identity: Objective hypothesis - Execution lineage", "category": "Identity", "archetype": "attribute"}
{"id": "Q384", "text": "Does attribution evidence for endpoint execution and persistence activity in process ancestry support a defensible objective hypothesis?", "label": "Host: Objective hypothesis - Process ancestry", "category": "Host", "archetype": "attribute"}
{"id": "Q385", "text": "Does attribution evidence for network session and transport activity in content lineage support a defensible objective hypothesis?", "label": "Network: Objective hypothesis - Content lineage", "category": "Network", "archetype": "attribute"}
{"id": "Q386", "text": "Does attribution evidence for cloud control-plane and workload activity in control-plane actions support a defensible objective hypothesis?", "label": "Cloud: Objective hypothesis - Control-plane actions", "category": "Cloud", "archetype": "attribute"}
{"id": "Q388", "text": "Did behavioral patterns around application request and session activity in network pivots support attribution confidence?", "label": "Application: Attribution confidence - Network pivots", "category": "Application", "archetype": "attribute"}
{"id": "Q389", "text": "Did behavioral patterns around file artifact and content activity in endpoint state changes support attribution confidence?", "label": "File: Attribution confidence - Endpoint state changes", "category": "File", "archetype": "attribute"}
{"id": "Q390", "text": "Did identity authentication and privilege activity in collaboration artifacts align with a repeatable adversary objective or technique pattern?", "label": "Identity: Technique pattern - Collaboration artifacts", "category": "Identity", "archetype": "attribute"}
{"id": "Q391", "text": "Did endpoint execution and persistence activity in execution lineage align with a repeatable adversary objective or technique pattern?", "label": "Host: Technique pattern - Execution lineage", "category": "Host", "archetype": "attribute"}
{"id": "Q392", "text": "Did network session and transport activity in process ancestry align with a repeatable adversary objective or technique pattern?", "label": "Network: Technique pattern - Process ancestry", "category": "Network", "archetype": "attribute"}
{"id": "Q394", "text": "Did mailbox message and collaboration activity in control-plane actions align with a repeatable adversary objective or technique pattern?", "label": "Email: Technique pattern - Control-plane actions", "category": "Email", "archetype": "attribute"}
{"id": "Q396", "text": "Was file artifact and content activity in network pivots attributable to a coherent activity cluster with common intent?", "label": "File: Activity clustering - Network pivots", "category": "File", "archetype": "attribute"}
{"id": "Q397", "text": "Does attribution evidence for identity authentication and privilege activity in session anomalies support a defensible objective hypothesis?", "label": "Identity: Objective hypothesis - Session anomalies", "category": "Identity", "archetype": "attribute"}
{"id": "Q399", "text": "Does attribution evidence for network session and transport activity in execution lineage support a defensible objective hypothesis?", "label": "Network: Objective hypothesis - Execution lineage", "category": "Network", "archetype": "attribute"}
{"id": "Q401", "text": "Does attribution evidence for mailbox message and collaboration activity in content lineage support a defensible objective hypothesis?", "label": "Email: Objective hypothesis - Content lineage", "category": "Email", "archetype": "attribute"}
{"id": "Q402", "text": "Did behavioral patterns around application request and session activity in data access traces support attribution confidence?", "label": "Application: Attribution confidence - Data access traces", "category": "Application", "archetype": "attribute"}
{"id": "Q409", "text": "Was application request and session activity in authentication pathways attributable to a coherent activity cluster with common intent?", "label": "Application: Activity clustering - Authentication pathways", "category": "Application", "archetype": "attribute"}
{"id": "Q410", "text": "Was file artifact and content activity in data access traces attributable to a coherent activity cluster with common intent?", "label": "File: Activity clustering - Data access traces", "category": "File", "archetype": "attribute"}
{"id": "Q412", "text": "Does attribution evidence for endpoint execution and persistence activity in privileged access events support a defensible objective hypothesis?", "label": "Host: Objective hypothesis - Privileged access events", "category": "Host", "archetype": "attribute"}
{"id": "Q413", "text": "Does attribution evidence for network session and transport activity in session anomalies support a defensible objective hypothesis?", "label": "Network: Objective hypothesis - Session anomalies", "category": "Network", "archetype": "attribute"}
{"id": "Q414", "text": "Does attribution evidence for cloud control-plane and workload activity in collaboration artifacts support a defensible objective hypothesis?", "label": "Cloud: Objective hypothesis - Collaboration artifacts", "category": "Cloud", "archetype": "attribute"}
{"id": "Q415", "text": "Does attribution evidence for mailbox message and collaboration activity in execution lineage support a defensible objective hypothesis?", "label": "Email: Objective hypothesis - Execution lineage", "category": "Email", "archetype": "attribute"}
{"id": "Q416", "text": "Did behavioral patterns around application request and session activity in workload identity context support attribution confidence?", "label": "Application: Attribution confidence - Workload identity context", "category": "Application", "archetype": "attribute"}
{"id": "Q417", "text": "Did behavioral patterns around file artifact and content activity in authentication pathways support attribution confidence?", "label": "File: Attribution confidence - Authentication pathways", "category": "File", "archetype": "attribute"}
{"id": "Q418", "text": "Did identity authentication and privilege activity in control-plane actions align with a repeatable adversary objective or technique pattern?", "label": "Identity: Technique pattern - Control-plane actions", "category": "Identity", "archetype": "attribute"}
{"id": "Q419", "text": "Did endpoint execution and persistence activity in transport metadata align with a repeatable adversary objective or technique pattern?", "label": "Host: Technique pattern - Transport metadata", "category": "Host", "archetype": "attribute"}
{"id": "Q420", "text": "Did network session and transport activity in privileged access events align with a repeatable adversary objective or technique pattern?", "label": "Network: Technique pattern - Privileged access events", "category": "Network", "archetype": "attribute"}
{"id": "Q421", "text": "Did cloud control-plane and workload activity in session anomalies align with a repeatable adversary objective or technique pattern?", "label": "Cloud: Technique pattern - Session anomalies", "category": "Cloud", "archetype": "attribute"}
{"id": "Q422", "text": "Did mailbox message and collaboration activity in collaboration artifacts align with a repeatable adversary objective or technique pattern?", "label": "Email: Technique pattern - Collaboration artifacts", "category": "Email", "archetype": "attribute"}
{"id": "Q423", "text": "Was application request and session activity in message delivery paths attributable to a coherent activity cluster with common intent?", "label": "Application: Activity clustering - Message delivery paths", "category": "Application", "archetype": "attribute"}
{"id": "Q424", "text": "Was file artifact and content activity in workload identity context attributable to a coherent activity cluster with common intent?", "label": "File: Activity clustering - Workload identity context", "category": "File", "archetype": "attribute"}
{"id": "Q425", "text": "Does attribution evidence for identity authentication and privilege activity in content lineage support a defensible objective hypothesis?", "label": "Identity: Objective hypothesis - Content lineage", "category": "Identity", "archetype": "attribute"}
{"id": "Q426", "text": "Does attribution evidence for endpoint execution and persistence activity in control-plane actions support a defensible objective hypothesis?", "label": "Host: Objective hypothesis - Control-plane actions", "category": "Host", "archetype": "attribute"}
{"id": "Q428", "text": "Does attribution evidence for cloud control-plane and workload activity in privileged access events support a defensible objective hypothesis?", "label": "Cloud: Objective hypothesis - Privileged access events", "category": "Cloud", "archetype": "attribute"}
{"id": "Q429", "text": "Does attribution evidence for mailbox message and collaboration activity in session anomalies support a defensible objective hypothesis?", "label": "Email: Objective hypothesis - Session anomalies", "category": "Email", "archetype": "attribute"}
{"id": "Q430", "text": "Did behavioral patterns around application request and session activity in artifact provenance support attribution confidence?", "label": "Application: Attribution confidence - Artifact provenance", "category": "Application", "archetype": "attribute"}
{"id": "Q431", "text": "Was identity authentication and privilege activity in data access traces attributable to a coherent activity cluster with common intent?", "label": "Identity: Activity clustering - Data access traces", "category": "Identity", "archetype": "attribute"}
{"id": "Q432", "text": "Was endpoint execution and persistence activity in api invocation patterns attributable to a coherent activity cluster with common intent?", "label": "Host: Activity clustering - API invocation patterns", "category": "Host", "archetype": "attribute"}
{"id": "Q433", "text": "Was network session and transport activity in network pivots attributable to a coherent activity cluster with common intent?", "label": "Network: Activity clustering - Network pivots", "category": "Network", "archetype": "attribute"}
{"id": "Q435", "text": "Was mailbox message and collaboration activity in artifact provenance attributable to a coherent activity cluster with common intent?", "label": "Email: Activity clustering - Artifact provenance", "category": "Email", "archetype": "attribute"}
{"id": "Q436", "text": "Does attribution evidence for application request and session activity in process ancestry support a defensible objective hypothesis?", "label": "Application: Objective hypothesis - Process ancestry", "category": "Application", "archetype": "attribute"}
{"id": "Q437", "text": "Did identity authentication and privilege activity in privileged access events align with a repeatable adversary objective or technique pattern?", "label": "Identity: Technique pattern - Privileged access events", "category": "Identity", "archetype": "attribute"}
{"id": "Q439", "text": "Did network session and transport activity in collaboration artifacts align with a repeatable adversary objective or technique pattern?", "label": "Network: Technique pattern - Collaboration artifacts", "category": "Network", "archetype": "attribute"}
{"id": "Q440", "text": "Did cloud control-plane and workload activity in execution lineage align with a repeatable adversary objective or technique pattern?", "label": "Cloud: Technique pattern - Execution lineage", "category": "Cloud", "archetype": "attribute"}
{"id": "Q441", "text": "Did mailbox message and collaboration activity in process ancestry align with a repeatable adversary objective or technique pattern?", "label": "Email: Technique pattern - Process ancestry", "category": "Email", "archetype": "attribute"}
{"id": "Q442", "text": "Did identity authentication and privilege activity in process ancestry align with a repeatable adversary objective or technique pattern?", "label": "Identity: Technique pattern - Process ancestry", "category": "Identity", "archetype": "attribute"}
{"id": "Q443", "text": "Did endpoint execution and persistence activity in content lineage align with a repeatable adversary objective or technique pattern?", "label": "Host: Technique pattern - Content lineage", "category": "Host", "archetype": "attribute"}
{"id": "Q445", "text": "Did cloud control-plane and workload activity in transport metadata align with a repeatable adversary objective or technique pattern?", "label": "Cloud: Technique pattern - Transport metadata", "category": "Cloud", "archetype": "attribute"}
{"id": "Q448", "text": "Did endpoint execution and persistence activity in session anomalies align with a repeatable adversary objective or technique pattern?", "label": "Host: Technique pattern - Session anomalies", "category": "Host", "archetype": "attribute"}
{"id": "Q449", "text": "Did behavioral patterns around identity authentication and privilege activity in message delivery paths support attribution confidence?", "label": "Identity: Attribution confidence - Message delivery paths", "category": "Identity", "archetype": "attribute"}
{"id": "Q466", "text": "Was mission or business exposure from identity authentication and privilege activity measured with evidence?", "label": "Identity: Business exposure", "category": "Identity", "archetype": "impact"}
{"id": "Q467", "text": "Was mission or business exposure from endpoint execution and persistence activity measured with evidence?", "label": "Host: Business exposure", "category": "Host", "archetype": "impact"}
{"id": "Q472", "text": "Have downstream security impacts from file artifact and content activity been evidenced and bounded?", "label": "File: Downstream impact", "category": "File", "archetype": "impact"}
{"id": "Q490", "text": "Did mailbox message and collaboration activity in privileged access events create measurable confidentiality, integrity, or availability impact?", "label": "Email: CIA impact - Privileged access events", "category": "Email", "archetype": "impact"}
{"id": "Q491", "text": "Did application request and session activity in session anomalies create measurable confidentiality, integrity, or availability impact?", "label": "Application: CIA impact - Session anomalies", "category": "Application", "archetype": "impact"}
{"id": "Q492", "text": "Did identity authentication and privilege activity result in measurable operational or data risk?", "label": "Identity: Operational/data risk", "category": "Identity", "archetype": "impact"}
{"id": "Q493", "text": "Did endpoint execution and persistence activity result in measurable operational or data risk?", "label": "Host: Operational/data risk", "category": "Host", "archetype": "impact"}
{"id": "Q494", "text": "Did network session and transport activity result in measurable operational or data risk?", "label": "Network: Operational/data risk", "category": "Network", "archetype": "impact"}
{"id": "Q495", "text": "Did cloud control-plane and workload activity result in measurable operational or data risk?", "label": "Cloud: Operational/data risk", "category": "Cloud", "archetype": "impact"}
{"id": "Q496", "text": "Did mailbox message and collaboration activity result in measurable operational or data risk?", "label": "Email: Operational/data risk", "category": "Email", "archetype": "impact"}
{"id": "Q497", "text": "Did application request and session activity result in measurable operational or data risk?", "label": "Application: Operational/data risk", "category": "Application", "archetype": "impact"}
{"id": "Q498", "text": "Have downstream security impacts from identity authentication and privilege activity in transport metadata been evidenced and bounded?", "label": "Identity: Downstream impact - Transport metadata", "category": "Identity", "archetype": "impact"}
{"id": "Q499", "text": "Have downstream security impacts from endpoint execution and persistence activity in privileged access events been evidenced and bounded?", "label": "Host: Downstream impact - Privileged access events", "category": "Host", "archetype": "impact"}
{"id": "Q500", "text": "Have downstream security impacts from network session and transport activity in session anomalies been evidenced and bounded?", "label": "Network: Downstream impact - Session anomalies", "category": "Network", "archetype": "impact"}
{"id": "Q502", "text": "Have downstream security impacts from mailbox message and collaboration activity in execution lineage been evidenced and bounded?", "label": "Email: Downstream impact - Execution lineage", "category": "Email", "archetype": "impact"}
{"id": "Q503", "text": "Have downstream security impacts from application request and session activity in process ancestry been evidenced and bounded?", "label": "Application: Downstream impact - Process ancestry", "category": "Application", "archetype": "impact"}
{"id": "Q506", "text": "Was mission or business exposure from network session and transport activity measured with evidence?", "label": "Network: Business exposure", "category": "Network", "archetype": "impact"}
{"id": "Q507", "text": "Was mission or business exposure from cloud control-plane and workload activity measured with evidence?", "label": "Cloud: Business exposure", "category": "Cloud", "archetype": "impact"}
{"id": "Q508", "text": "Was mission or business exposure from mailbox message and collaboration activity measured with evidence?", "label": "Email: Business exposure", "category": "Email", "archetype": "impact"}
{"id": "Q509", "text": "Was mission or business exposure from application request and session activity measured with evidence?", "label": "Application: Business exposure", "category": "Application", "archetype": "impact"}
{"id": "Q510", "text": "Did identity authentication and privilege activity create measurable confidentiality, integrity, or availability impact?", "label": "Identity: CIA impact", "category": "Identity", "archetype": "impact"}
{"id": "Q511", "text": "Did endpoint execution and persistence activity create measurable confidentiality, integrity, or availability impact?", "label": "Host: CIA impact", "category": "Host", "archetype": "impact"}
{"id": "Q512", "text": "Did network session and transport activity create measurable confidentiality, integrity, or availability impact?", "label": "Network: CIA impact", "category": "Network", "archetype": "impact"}
{"id": "Q513", "text": "Did cloud control-plane and workload activity create measurable confidentiality, integrity, or availability impact?", "label": "Cloud: CIA impact", "category": "Cloud", "archetype": "impact"}
{"id": "Q516", "text": "Have downstream security impacts from cloud control-plane and workload activity been evidenced and bounded?", "label": "Cloud: Downstream impact", "category": "Cloud", "archetype": "impact"}
{"id": "Q545", "text": "Was the investigation hypothesis for identity authentication and privilege activity resolved with sufficient objective evidence?", "label": "Identity: Hypothesis resolved", "category": "Identity", "archetype": "terminal"}
{"id": "Q546", "text": "Was the investigation hypothesis for endpoint execution and persistence activity resolved with sufficient objective evidence?", "label": "Host: Hypothesis resolved", "category": "Host", "archetype": "terminal"}
{"id": "Q547", "text": "Was the investigation hypothesis for network session and transport activity resolved with sufficient objective evidence?", "label": "Network: Hypothesis resolved", "category": "Network", "archetype": "terminal"}
{"id": "Q548", "text": "Was the investigation hypothesis for cloud control-plane and workload activity resolved with sufficient objective evidence?", "label": "Cloud: Hypothesis resolved", "category": "Cloud", "archetype": "terminal"}
{"id": "Q549", "text": "Was the investigation hypothesis for mailbox message and collaboration activity resolved with sufficient objective evidence?", "label": "Email: Hypothesis resolved", "category": "Email", "archetype": "terminal"}
{"id": "Q550", "text": "Was the investigation hypothesis for application request and session activity resolved with sufficient objective evidence?", "label": "Application: Hypothesis resolved", "category": "Application", "archetype": "terminal"}
{"id": "Q552", "text": "Was residual uncertainty for identity authentication and privilege activity documented in the terminal assessment?", "label": "Identity: Residual uncertainty", "category": "Identity", "archetype": "terminal"}
{"id": "Q553", "text": "Was residual uncertainty for endpoint execution and persistence activity documented in the terminal assessment?", "label": "Host: Residual uncertainty", "category": "Host", "archetype": "terminal"}
{"id": "Q554", "text": "Was residual uncertainty for network session and transport activity documented in the terminal assessment?", "label": "Network: Residual uncertainty", "category": "Network", "archetype": "terminal"}
{"id": "Q555", "text": "Was residual uncertainty for cloud control-plane and workload activity documented in the terminal assessment?", "label": "Cloud: Residual uncertainty", "category": "Cloud", "archetype": "terminal"}
{"id": "Q556", "text": "Was residual uncertainty for mailbox message and collaboration activity documented in the terminal assessment?", "label": "Email: Residual uncertainty", "category": "Email", "archetype": "terminal"}
{"id": "Q557", "text": "Was residual uncertainty for application request and session activity documented in the terminal assessment?", "label": "Application: Residual uncertainty", "category": "Application", "archetype": "terminal"}
{"id": "Q558", "text": "Have findings for identity authentication and privilege activity reached a defensible terminal assessment?", "label": "Identity: Terminal assessment", "category": "Identity", "archetype": "terminal"}
{"id": "Q559", "text": "Have findings for endpoint execution and persistence activity reached a defensible terminal assessment?", "label": "Host: Terminal assessment", "category": "Host", "archetype": "terminal"}
{"id": "Q560", "text": "Have findings for network session and transport activity reached a defensible terminal assessment?", "label": "Network: Terminal assessment", "category": "Network", "archetype": "terminal"}
{"id": "Q561", "text": "Have findings for cloud control-plane and workload activity reached a defensible terminal assessment?", "label": "Cloud: Terminal assessment", "category": "Cloud", "archetype": "terminal"}
{"id": "Q562", "text": "Have findings for mailbox message and collaboration activity reached a defensible terminal assessment?", "label": "Email: Terminal assessment", "category": "Email", "archetype": "terminal"}
{"id": "Q563", "text": "Have findings for application request and session activity reached a defensible terminal assessment?", "label": "Application: Terminal assessment", "category": "Application", "archetype": "terminal"}
{"id": "Q574", "text": "Have terminal criteria for mailbox message and collaboration activity been satisfied by verified evidence?", "label": "Email: Terminal criteria", "category": "Email", "archetype": "terminal"}
{"id": "Q575", "text": "Have terminal criteria for identity authentication and privilege activity been satisfied by verified evidence?", "label": "Identity: Terminal criteria", "category": "Identity", "archetype": "terminal"}
{"id": "Q576", "text": "Have terminal criteria for endpoint execution and persistence activity been satisfied by verified evidence?", "label": "Host: Terminal criteria", "category": "Host", "archetype": "terminal"}
{"id": "Q577", "text": "Have terminal criteria for network session and transport activity been satisfied by verified evidence?", "label": "Network: Terminal criteria", "category": "Network", "archetype": "terminal"}
{"id": "Q578", "text": "Have terminal criteria for cloud control-plane and workload activity been satisfied by verified evidence?", "label": "Cloud: Terminal criteria", "category": "Cloud", "archetype": "terminal"}
{"id": "Q581", "text": "Did file artifact and content activity create measurable confidentiality, integrity, or availability impact?", "label": "File: CIA impact", "category": "File", "archetype": "impact"}
{"id": "Q584", "text": "Was the investigation hypothesis for file artifact and content activity resolved with sufficient objective evidence?", "label": "File: Hypothesis resolved", "category": "File", "archetype": "terminal"}
{"id": "Q586", "text": "Was residual uncertainty for file artifact and content activity documented in the terminal assessment?", "label": "File: Residual uncertainty", "category": "File", "archetype": "terminal"}
{"id": "Q587", "text": "Have terminal criteria for file artifact and content activity been satisfied by verified evidence?", "label": "File: Terminal criteria", "category": "File", "archetype": "terminal"}
{"id": "Q588", "text": "Have findings for file artifact and content activity reached a defensible terminal assessment?", "label": "File: Terminal assessment", "category": "File", "archetype": "terminal"}
